[
    {
        "id": "1",
        "title": "P2 : Transformez une maquette en site web avec HTML et CSS",
        "description": "Démarrez sur HTML et CSS en intégrant la page Web de Booki, une plateforme de réservation de vacances.",
        "compétences": [
            "1. Implémenter une interface responsive",
            "2. Intégrer du contenu conformément à une maquette"
        ]
    },

    {
        "id": "2",
        "title": "P3 : Dynamisez une page web avec des animations CSS",
        "description": "Implémentez la version mobile d'un site de foodtech avec des animations CSS.",
        "compétences": [
            "1. Mettre en oeuvre des effets CSS graphiques avancés",
            "2. Assurer la cohérence graphique d'un site web",
            "3. Mettre en place son environnement Front-End",
            "4. Mettre en place une structure de navigation pour un site web",
            "5. Utiliser un système de gestion de versions pour le suivi du projet et son hébergement"
        ]
    },

    {
        "id": "3",
        "title": "P4 : Optimisez une site web existant",
        "description": "Faites passer le site web de votre entreprise en tête des résultats Google grâce à la mise en place de bonnes pratiques SEO.",
        "compétences": [
            "1. Réaliser une recherche des bonnes pratiques en développement web",
            "2. Optimiser la taille et la vitesse d’un site web",
            "3. Écrire un code HTML et CSS maintenable",
            "4. Optimiser le référencement d'un site web",
            "5. Assurer l'accessibilité d'un site web"
        ]
    },

    {
        "id": "4",
        "title": "P5 : Construisez un site e-commerce en Javascript",
        "description": "Intégrez de manière dynamique les maquettes du site de Kanap avec Javascript. Vous utiliserez l'API pour récupérer les produits et leurs détails, et vous gérerez l'ajout des produits au panier.",
        "compétences": [
            "1. Gérer des événements JavaScript",
            "2. Interagir avec un web service avec JavaScript",
            "3. Valider des données issues de sources externes",
            "4. Créer un plan de test pour une application"
        ]
    },

    {
        "id": "5",
        "title": "Construisez une API sécurisée pour une application d'avis gastronomiques",
        "description": "Créez le backend et l'API d'une application d'avis gastronomiques de sauces piquantes. Utilisez les technologies Node.js, Express et MongoDB pour construire la base de données NoSQL. Sécurisez les données grâce aux normes de l'OWASP.",
        "compétences": [
            "1. Mettre en œuvre des opérations CRUD de manière sécurisée",
            "2. Stocker des données de manière sécurisée",
            "3. Implémenter un modèle logique de données conformément à la réglementation"

        ]
    },

    {
        "id": "6",
        "title": "Créez une application web de location immobilière avec React",
        "description": "Implémentez le front end de Kasa, une application de location de logements. Mettez en place des composants avec React et les routes de l'application avec React Router.",
        "compétences": [
            "1. Initialiser une application avec Create React App",
            "2. Configurer la navigation entre les pages de l'application avec React Router",
            "3. Développer des éléments de l'interface d'un site web grâce à des composants React"
        ]
    }
]